{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ec6ed84c",
   "metadata": {},
   "source": [
    "# Угадай число\n",
    "Нужно написать программу, которая угадывает число за минимальное число попыток.\n",
    "## Условия соревнования:\n",
    "Компьютер загадывает целое число от 1 до 100, и нам его нужно угадать. Под «угадать», подразумевается «написать программу, которая угадывает число».\n",
    "Алгоритм учитывает информацию о том, больше ли случайное число или меньше нужного нам.\n",
    "Необходимо добиться того, чтобы программа угадывала число меньше, чем за 20 попыток.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4e9692ef",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "import random"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ba5c448a",
   "metadata": {},
   "source": [
    "## Мое решение\n",
    "Необходимо написать функцию, которая принимает на вход загаданное число и возвращает число попыток угадывания.\n",
    "Цель - менее 20 попыток"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "aa140602",
   "metadata": {},
   "outputs": [],
   "source": [
    "def game_core_v3(number: int = 1) -> int:\n",
    "    \"\"\"\n",
    "    Args:\n",
    "        number (int, optional): Загаданное число. Defaults to 1.\n",
    "\n",
    "    Returns:\n",
    "        int: Число попыток\n",
    "    \"\"\"\n",
    "    # Ваш код начинается здесь\n",
    "\n",
    "    count = 0\n",
    "    bottom = 1  # присваиваем значение, соответствующее нижней границе диапазона поиска\n",
    "    top = 101  # присваиваем значение, соответствующее верхней границе диапазона поиска +1\n",
    "\n",
    "    while True:\n",
    "        average_number = (bottom + top)//2\n",
    "        count += 1\n",
    "        if average_number == number:\n",
    "            break  # выход из цикла если угадали\n",
    "        elif number > average_number:\n",
    "            bottom = average_number  # перезаписываем переменную bottom\n",
    "        else:\n",
    "            top = average_number # перезаписываем переменную top\n",
    "\n",
    "    return count\n",
    "\n",
    "    # Ваш код заканчивается здесь"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2c5078c0",
   "metadata": {},
   "source": [
    "Функция для оценки"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "bd43ed68",
   "metadata": {},
   "outputs": [],
   "source": [
    "def score_game(random_predict) -> int:\n",
    "    \"\"\"За какое количество попыток в среднем за 10000 подходов угадывает наш алгоритм\n",
    "\n",
    "    Args:\n",
    "        random_predict ([type]): функция угадывания\n",
    "\n",
    "    Returns:\n",
    "        int: среднее количество попыток\n",
    "    \"\"\"\n",
    "    count_ls = []\n",
    "    #np.random.seed(1)  # фиксируем сид для воспроизводимости\n",
    "    random_array = np.random.randint(1, 101, size=(10000))  # загадали список чисел\n",
    "\n",
    "    for number in random_array:\n",
    "        count_ls.append(random_predict(number))\n",
    "\n",
    "    score = int(np.mean(count_ls))\n",
    "    print(f\"Ваш алгоритм угадывает число в среднем за: {score} попытки\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "e7e31e64",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Run benchmarking for game_core_v3: Ваш алгоритм угадывает число в среднем за: 5 попытки\n"
     ]
    }
   ],
   "source": [
    "print('Run benchmarking for game_core_v3: ', end='')\n",
    "score_game(game_core_v3)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.14.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
